In [1]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
animals = pd.read_csv('animal kingdom.csv') #allows us to import a data file

In [3]:
animals

        animal  age gender
0          dog   10      F
1          cat    5      M
2          cat    4      M
3     elephant   10      M
4     elephant   40      F
5          dog   12      F
6          cat   15      F
7          rat    3      F
8          rat    3      F
9          rat    2      M
10         rat    1      F
11       tiger    5      M
12       tiger    8      F
13  chinchilla   10      M

In [18]:
unique = animals['animal'].unique()
unique

array(['dog', 'cat', 'elephant', 'rat', 'tiger', 'chinchilla'],
      dtype=object)

In [26]:
amt = animals['animal'].value_counts()
amt

rat           4
cat           3
elephant      2
tiger         2
dog           2
chinchilla    1
Name: animal, dtype: int64

In [30]:
new_df = pd.DataFrame(amt)

In [31]:
new_df

            animal
rat              4
cat              3
elephant         2
tiger            2
dog              2
chinchilla       1